#### `terragrunt plan` Success
<details><summary>Show Output</summary>

```
"1"
        }
      + setting {
          + name      = "BatchSizeType"
          + namespace = "aws:elasticbeanstalk:command"
          + value     = "Fixed"
        }
      + setting {
          + name      = "ConnectionDrainingEnabled"
          + namespace = "aws:elb:policies"
          + value     = "true"
        }
      + setting {
          + name      = "ConnectionSettingIdleTimeout"
          + namespace = "aws:elb:policies"
          + value     = "60"
        }
      + setting {
          + name      = "CrossZone"
          + namespace = "aws:elb:loadbalancer"
          + value     = "true"
        }
      + setting {
          + name      = "DB_HOST"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "xxxxxxxxxxxxxx"
        }
      + setting {
          + name      = "DB_PASSWORD"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "zzzzzzzzzzzzzzzzzzz"
        }
      + setting {
          + name      = "DB_USERNAME"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "yyyyyyyyyyyyy"
        }
      + setting {
          + name      = "DeleteOnTerminate"
          + namespace = "aws:elasticbeanstalk:cloudwatch:logs"
          + value     = "false"
        }
      + setting {
          + name      = "DeleteOnTerminate"
          + namespace = "aws:elasticbeanstalk:cloudwatch:logs:health"
          + value     = "false"
        }
      + setting {
          + name      = "DeploymentPolicy"
          + namespace = "aws:elasticbeanstalk:command"
          + value     = "Rolling"
        }
      + setting {
          + name      = "EC2KeyName"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "onedio201604"
        }
      + setting {
          + name      = "ELBScheme"
          + namespace = "aws:ec2:vpc"
          + value     = "public"
        }
      + setting {
          + name      = "ELBSubnets"
          + namespace = "aws:ec2:vpc"
          + value     = "subnet-00515174,subnet-395eba5c"
        }
      + setting {
          + name      = "EnableSpot"
          + namespace = "aws:ec2:instances"
          + value     = "false"
        }
      + setting {
          + name      = "EnvironmentType"
          + namespace = "aws:elasticbeanstalk:environment"
          + value     = "LoadBalanced"
        }
      + setting {
          + name      = "HealthCheckPath"
          + namespace = "aws:elasticbeanstalk:environment:process:default"
          + value     = "/varnish-ok"
        }
      + setting {
          + name      = "HealthStreamingEnabled"
          + namespace = "aws:elasticbeanstalk:cloudwatch:logs:health"
          + value     = "false"
        }
      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "onedio-test-varnish-test-eb-ec2"
        }
      + setting {
          + name      = "IgnoreHealthCheck"
          + namespace = "aws:elasticbeanstalk:command"
          + value     = "false"
        }
      + setting {
          + name      = "InstancePort"
          + namespace = "aws:elb:listener"
          + value     = "80"
        }
      + setting {
          + name      = "InstancePort"
          + namespace = "aws:elb:listener:22"
          + value     = "22"
        }
      + setting {
          + name      = "InstancePort"
          + namespace = "aws:elb:listener:443"
          + value     = "80"
        }
      + setting {
          + name      = "InstanceRefreshEnabled"
          + namespace = "aws:elasticbeanstalk:managedactions:platformupdate"
          + value     = "true"
        }
      + setting {
          + name      = "InstanceTypes"
          + namespace = "aws:ec2:instances"
          + value     = "t3.micro"
        }
      + setting {
          + name      = "ListenerEnabled"
          + namespace = "aws:elb:listener"
          + value     = "true"
        }
      + setting {
          + name      = "ListenerEnabled"
          + namespace = "aws:elb:listener:22"
          + value     = "false"
        }
      + setting {
          + name      = "ListenerEnabled"
          + namespace = "aws:elb:listener:443"
          + value     = "false"
        }
      + setting {
          + name      = "ListenerProtocol"
          + namespace = "aws:elb:listener"
          + value     = "HTTP"
        }
      + setting {
          + name      = "ListenerProtocol"
          + namespace = "aws:elb:listener:22"
          + value     = "TCP"
        }
      + setting {
          + name      = "ListenerProtocol"
          + namespace = "aws:elb:listener:443"
          + value     = "HTTPS"
        }
      + setting {
          + name      = "LoadBalancerType"
          + namespace = "aws:elasticbeanstalk:environment"
          + value     = "classic"
        }
      + setting {
          + name      = "LogPublicationControl"
          + namespace = "aws:elasticbeanstalk:hostmanager"
          + value     = "false"
        }
      + setting {
          + name      = "LowerBreachScaleIncrement"
          + namespace = "aws:autoscaling:trigger"
          + value     = "-1"
        }
      + setting {
          + name      = "LowerThreshold"
          + namespace = "aws:autoscaling:trigger"
          + value     = "20"
        }
      + setting {
          + name      = "ManagedActionsEnabled"
          + namespace = "aws:elasticbeanstalk:managedactions"
          + value     = "false"
        }
      + setting {
          + name      = "ManagedActionsEnabled"
          + namespace = "aws:elasticbeanstalk:managedactions"
          + value     = "true"
        }
      + setting {
          + name      = "ManagedSecurityGroup"
          + namespace = "aws:elb:loadbalancer"
        }
      + setting {
          + name      = "MaxBatchSize"
          + namespace = "aws:autoscaling:updatepolicy:rollingupdate"
          + value     = "1"
        }
      + setting {
          + name      = "MaxSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "2"
        }
      + setting {
          + name      = "MeasureName"
          + namespace = "aws:autoscaling:trigger"
          + value     = "CPUUtilization"
        }
      + setting {
          + name      = "MinInstancesInService"
          + namespace = "aws:autoscaling:updatepolicy:rollingupdate"
          + value     = "0"
        }
      + setting {
          + name      = "MinSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "1"
        }
      + setting {
          + name      = "Port"
          + namespace = "aws:elasticbeanstalk:environment:process:default"
          + value     = "80"
        }
      + setting {
          + name      = "PreferredStartTime"
          + namespace = "aws:elasticbeanstalk:managedactions"
          + value     = "Sun:10:00"
        }
      + setting {
          + name      = "Protocol"
          + namespace = "aws:elasticbeanstalk:environment:process:default"
          + value     = "HTTP"
        }
      + setting {
          + name      = "RetentionInDays"
          + namespace = "aws:elasticbeanstalk:cloudwatch:logs"
          + value     = "7"
        }
      + setting {
          + name      = "RetentionInDays"
          + namespace = "aws:elasticbeanstalk:cloudwatch:logs:health"
          + value     = "7"
        }
      + setting {
          + name      = "RollingUpdateEnabled"
          + namespace = "aws:autoscaling:updatepolicy:rollingupdate"
          + value     = "true"
        }
      + setting {
          + name      = "RollingUpdateType"
          + namespace = "aws:autoscaling:updatepolicy:rollingupdate"
          + value     = "Health"
        }
      + setting {
          + name      = "RootVolumeSize"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "20"
        }
      + setting {
          + name      = "RootVolumeType"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "gp2"
        }
      + setting {
          + name      = "SSLCertificateId"
          + namespace = "aws:elb:listener:443"
        }
      + setting {
          + name      = "SecurityGroups"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = (known after apply)
        }
      + setting {
          + name      = "SecurityGroups"
          + namespace = "aws:elb:loadbalancer"
          + value     = "sg-0f8ba186278d9f047"
        }
      + setting {
          + name      = "ServiceRole"
          + namespace = "aws:elasticbeanstalk:environment"
          + value     = "onedio-test-varnish-test-eb-service"
        }
      + setting {
          + name      = "SpotFleetOnDemandAboveBasePercentage"
          + namespace = "aws:ec2:instances"
          + value     = "70"
        }
      + setting {
          + name      = "SpotFleetOnDemandBase"
          + namespace = "aws:ec2:instances"
          + value     = "0"
        }
      + setting {
          + name      = "SpotMaxPrice"
          + namespace = "aws:ec2:instances"
        }
      + setting {
          + name      = "Statistic"
          + namespace = "aws:autoscaling:trigger"
          + value     = "Average"
        }
      + setting {
          + name      = "StickinessEnabled"
          + namespace = "aws:elasticbeanstalk:environment:process:default"
          + value     = "false"
        }
      + setting {
          + name      = "StreamLogs"
          + namespace = "aws:elasticbeanstalk:cloudwatch:logs"
          + value     = "false"
        }
      + setting {
          + name      = "Subnets"
          + namespace = "aws:ec2:vpc"
          + value     = "subnet-00515174,subnet-395eba5c"
        }
      + setting {
          + name      = "SystemType"
          + namespace = "aws:elasticbeanstalk:healthreporting:system"
          + value     = "enhanced"
        }
      + setting {
          + name      = "Timeout"
          + namespace = "aws:elasticbeanstalk:command"
          + value     = "600"
        }
      + setting {
          + name      = "Unit"
          + namespace = "aws:autoscaling:trigger"
          + value     = "Percent"
        }
      + setting {
          + name      = "UpdateLevel"
          + namespace = "aws:elasticbeanstalk:managedactions:platformupdate"
          + value     = "minor"
        }
      + setting {
          + name      = "UpperBreachScaleIncrement"
          + namespace = "aws:autoscaling:trigger"
          + value     = "1"
        }
      + setting {
          + name      = "UpperThreshold"
          + namespace = "aws:autoscaling:trigger"
          + value     = "80"
        }
      + setting {
          + name      = "VPCId"
          + namespace = "aws:ec2:vpc"
          + value     = "vpc-20938e42"
        }
    }

  # module.elastic_beanstalk_environment.aws_iam_instance_profile.ec2 will be created
  + resource "aws_iam_instance_profile" "ec2" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "onedio-test-varnish-test-eb-ec2"
      + path        = "/"
      + role        = "onedio-test-varnish-test-eb-ec2"
      + unique_id   = (known after apply)
    }

  # module.elastic_beanstalk_environment.aws_iam_role.ec2 will be created
  + resource "aws_iam_role" "ec2" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ssm.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "onedio-test-varnish-test-eb-ec2"
      + path                  = "/"
      + tags                  = {
          + "Name"        = "varnish-test"
          + "Namespace"   = "onedio"
          + "Stage"       = "test"
          + "account"     = "onedio"
          + "environment" = "test"
          + "product"     = "varnish"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.elastic_beanstalk_environment.aws_iam_role.service will be created
  + resource "aws_iam_role" "service" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "elasticbeanstalk.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "onedio-test-varnish-test-eb-service"
      + path                  = "/"
      + tags                  = {
          + "Name"        = "varnish-test"
          + "Namespace"   = "onedio"
          + "Stage"       = "test"
          + "account"     = "onedio"
          + "environment" = "test"
          + "product"     = "varnish"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.elastic_beanstalk_environment.aws_iam_role_policy.default will be created
  + resource "aws_iam_role_policy" "default" {
      + id     = (known after apply)
      + name   = "onedio-test-varnish-test-eb-default"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:GetQueueUrl",
                          + "sqs:GetQueueAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeInstanceHealth",
                          + "ec2:GetConsoleOutput",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceStatus",
                          + "ec2:DescribeAddresses",
                          + "ec2:AssociateAddress",
                          + "autoscaling:DescribeScalingActivities",
                          + "autoscaling:DescribeNotificationConfigurations",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeAutoScalingGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "sqs:GetQueueUrl",
                          + "sqs:GetQueueAttributes",
                          + "sns:Subscribe",
                          + "sns:ListSubscriptionsByTopic",
                          + "sns:GetTopicAttributes",
                          + "sns:CreateTopic",
                          + "s3:ListBucket",
                          + "s3:GetObjectAcl",
                          + "s3:GetObject",
                          + "rds:DescribeOrderableDBInstanceOptions",
                          + "rds:DescribeDBInstances",
                          + "rds:DescribeDBEngineVersions",
                          + "logs:PutRetentionPolicy",
                          + "logs:CreateLogGroup",
                          + "iam:PassRole",
                          + "iam:ListRoles",
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:RegisterInstancesWithLoadBalancer",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeInstanceHealth",
                          + "elasticloadbalancing:DeregisterTargets",
                          + "elasticloadbalancing:DeregisterInstancesFromLoadBalancer",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:ConfigureHealthCheck",
                          + "elasticloadbalancing:ApplySecurityGroupsToLoadBalancer",
                          + "elasticbeanstalk:*",
                          + "ecs:RegisterTaskDefinition",
                          + "ecs:DescribeClusters",
                          + "ecs:DeleteCluster",
                          + "ecs:CreateCluster",
                          + "ec2:TerminateInstances",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupEgress",
                          + "ec2:ReleaseAddress",
                          + "ec2:DisassociateAddress",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSnapshots",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeKeyPairs",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeImages",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DeleteSecurityGroup",
                          + "ec2:CreateSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:AuthorizeSecurityGroupEgress",
                          + "ec2:AssociateAddress",
                          + "ec2:AllocateAddress",
                          + "codebuild:StartBuild",
                          + "codebuild:DeleteProject",
                          + "codebuild:CreateProject",
                          + "codebuild:BatchGetBuilds",
                          + "cloudwatch:PutMetricAlarm",
                          + "autoscaling:UpdateAutoScalingGroup",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "autoscaling:SuspendProcesses",
                          + "autoscaling:SetDesiredCapacity",
                          + "autoscaling:ResumeProcesses",
                          + "autoscaling:PutScheduledUpdateGroupAction",
                          + "autoscaling:DetachInstances",
                          + "autoscaling:DescribeScheduledActions",
                          + "autoscaling:DescribeScalingActivities",
                          + "autoscaling:DescribeNotificationConfigurations",
                          + "autoscaling:DescribeLoadBalancers",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeAutoScalingGroups",
                          + "autoscaling:DescribeAccountLimits",
                          + "autoscaling:DeleteScheduledAction",
                          + "autoscaling:DeleteLaunchConfiguration",
                          + "autoscaling:DeleteAutoScalingGroup",
                          + "autoscaling:CreateLaunchConfiguration",
                          + "autoscaling:CreateAutoScalingGroup",
                          + "autoscaling:AttachInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowOperations"
                    },
                  + {
                      + Action   = [
                          + "s3:ListAllMyBuckets",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowS3OperationsOnElasticBeanstalkBuckets"
                    },
                  + {
                      + Action   = "logs:DeleteLogGroup"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:log-group:/aws/elasticbeanstalk*"
                      + Sid      = "AllowDeleteCloudwatchLogGroups"
                    },
                  + {
                      + Action   = "cloudformation:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:cloudformation:*:*:stack/eb-*",
                          + "arn:aws:cloudformation:*:*:stack/awseb-*",
                        ]
                      + Sid      = "AllowCloudformationOperationsOnElasticBeanstalkStacks"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.elastic_beanstalk_environment.aws_iam_role_policy_attachment.ecr_readonly will be created
  + resource "aws_iam_role_policy_attachment" "ecr_readonly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "onedio-test-varnish-test-eb-ec2"
    }

  # module.elastic_beanstalk_environment.aws_iam_role_policy_attachment.elastic_beanstalk_multi_container_docker will be created
  + resource "aws_iam_role_policy_attachment" "elastic_beanstalk_multi_container_docker" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkMulticontainerDocker"
      + role       = "onedio-test-varnish-test-eb-ec2"
    }

  # module.elastic_beanstalk_environment.aws_iam_role_policy_attachment.enhanced_health[0] will be created
  + resource "aws_iam_role_policy_attachment" "enhanced_health" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSElasticBeanstalkEnhancedHealth"
      + role       = "onedio-test-varnish-test-eb-service"
    }

  # module.elastic_beanstalk_environment.aws_iam_role_policy_attachment.service will be created
  + resource "aws_iam_role_policy_attachment" "service" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkManagedUpdatesCustomerRolePolicy"
      + role       = "onedio-test-varnish-test-eb-service"
    }

  # module.elastic_beanstalk_environment.aws_iam_role_policy_attachment.ssm_automation will be created
  + resource "aws_iam_role_policy_attachment" "ssm_automation" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonSSMAutomationRole"
      + role       = "onedio-test-varnish-test-eb-ec2"
    }

  # module.elastic_beanstalk_environment.aws_iam_role_policy_attachment.ssm_ec2 will be created
  + resource "aws_iam_role_policy_attachment" "ssm_ec2" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "onedio-test-varnish-test-eb-ec2"
    }

  # module.elastic_beanstalk_environment.aws_iam_role_policy_attachment.web_tier will be created
  + resource "aws_iam_role_policy_attachment" "web_tier" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkWebTier"
      + role       = "onedio-test-varnish-test-eb-ec2"
    }

  # module.elastic_beanstalk_environment.aws_iam_role_policy_attachment.worker_tier will be created
  + resource "aws_iam_role_policy_attachment" "worker_tier" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSElasticBeanstalkWorkerTier"
      + role       = "onedio-test-varnish-test-eb-ec2"
    }

  # module.elastic_beanstalk_environment.aws_s3_bucket.elb_logs[0] will be created
  + resource "aws_s3_bucket" "elb_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "onedio-test-varnish-test-eb-loadbalancer-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + policy                      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:PutObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::156460612806:root"
                        }
                      + Resource  = "arn:aws:s3:::onedio-test-varnish-test-eb-loadbalancer-logs/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"        = "varnish-test"
          + "Namespace"   = "onedio"
          + "Stage"       = "test"
          + "account"     = "onedio"
          + "environment" = "test"
          + "product"     = "varnish"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.elastic_beanstalk_environment.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Allow inbound traffic from provided Security Groups"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = [
                  + "sg-0f8ba186278d9f047",
                ]
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = "onedio-test-varnish-test"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "varnish-test"
          + "Namespace"   = "onedio"
          + "Stage"       = "test"
          + "account"     = "onedio"
          + "environment" = "test"
          + "product"     = "varnish"
        }
      + vpc_id                 = "vpc-20938e42"
    }

  # module.elastic_beanstalk_environment.aws_ssm_activation.ec2 will be created
  + resource "aws_ssm_activation" "ec2" {
      + activation_code    = (known after apply)
      + expiration_date    = (known after apply)
      + expired            = (known after apply)
      + iam_role           = (known after apply)
      + id                 = (known after apply)
      + name               = "onedio-test-varnish-test"
      + registration_count = (known after apply)
      + registration_limit = 2
      + tags               = {
          + "Name"        = "varnish-test"
          + "Namespace"   = "onedio"
          + "Stage"       = "test"
          + "account"     = "onedio"
          + "environment" = "test"
          + "product"     = "varnish"
        }
    }

  # module.elastic_beanstalk_environment.module.dns_hostname.aws_route53_record.default[0] will be created
  + resource "aws_route53_record" "default" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "varnish-test"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z2JTEFLVSSQSOE"
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + elastic_beanstalk_application_name                           = "onedio-test-varnish-test"
  + elastic_beanstalk_environment_all_settings                   = (known after apply)
  + elastic_beanstalk_environment_application                    = "onedio-test-varnish-test"
  + elastic_beanstalk_environment_autoscaling_groups             = (known after apply)
  + elastic_beanstalk_environment_ec2_instance_profile_role_name = "onedio-test-varnish-test-eb-ec2"
  + elastic_beanstalk_environment_elb_zone_id                    = "Z2NYPWQ7DFZAZH"
  + elastic_beanstalk_environment_endpoint                       = (known after apply)
  + elastic_beanstalk_environment_hostname                       = (known after apply)
  + elastic_beanstalk_environment_id                             = (known after apply)
  + elastic_beanstalk_environment_instances                      = (known after apply)
  + elastic_beanstalk_environment_launch_configurations          = (known after apply)
  + elastic_beanstalk_environment_load_balancers                 = (known after apply)
  + elastic_beanstalk_environment_name                           = "onedio-test-varnish-test"
  + elastic_beanstalk_environment_queues                         = (known after apply)
  + elastic_beanstalk_environment_security_group_id              = (known after apply)
  + elastic_beanstalk_environment_setting                        = [
      + {
          + name      = "ANOTHER_ENV_VAR"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + resource  = ""
          + value     = "123456789"
        },
      + {
          + name      = "AssociatePublicIpAddress"
          + namespace = "aws:ec2:vpc"
          + resource  = ""
          + value     = "true"
        },
      + {
          + name      = "Availability Zones"
          + namespace = "aws:autoscaling:asg"
          + resource  = ""
          + value     = "Any 2"
        },
      + {
          + name      = "BASE_HOST"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + resource  = ""
          + value     = "varnish-test"
        },
      + {
          + name      = "BatchSize"
          + namespace = "aws:elasticbeanstalk:command"
          + resource  = ""
          + value     = "1"
        },
      + {
          + name      = "BatchSizeType"
          + namespace = "aws:elasticbeanstalk:command"
          + resource  = ""
          + value     = "Fixed"
        },
      + {
          + name      = "ConnectionDrainingEnabled"
          + namespace = "aws:elb:policies"
          + resource  = ""
          + value     = "true"
        },
      + {
          + name      = "ConnectionSettingIdleTimeout"
          + namespace = "aws:elb:policies"
          + resource  = ""
          + value     = "60"
        },
      + {
          + name      = "CrossZone"
          + namespace = "aws:elb:loadbalancer"
          + resource  = ""
          + value     = "true"
        },
      + {
          + name      = "DB_HOST"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + resource  = ""
          + value     = "xxxxxxxxxxxxxx"
        },
      + {
          + name      = "DB_PASSWORD"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + resource  = ""
          + value     = "zzzzzzzzzzzzzzzzzzz"
        },
      + {
          + name      = "DB_USERNAME"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + resource  = ""
          + value     = "yyyyyyyyyyyyy"
        },
      + {
          + name      = "DeleteOnTerminate"
          + namespace = "aws:elasticbeanstalk:cloudwatch:logs"
          + resource  = ""
          + value     = "false"
        },
      + {
          + name      = "DeleteOnTerminate"
          + namespace = "aws:elasticbeanstalk:cloudwatch:logs:health"
          + resource  = ""
          + value     = "false"
        },
      + {
          + name      = "DeploymentPolicy"
          + namespace = "aws:elasticbeanstalk:command"
          + resource  = ""
          + value     = "Rolling"
        },
      + {
          + name      = "EC2KeyName"
          + namespace = "aws:autoscaling:launchconfiguration"
          + resource  = ""
          + value     = "onedio201604"
        },
      + {
          + name      = "ELBScheme"
          + namespace = "aws:ec2:vpc"
          + resource  = ""
          + value     = "public"
        },
      + {
          + name      = "ELBSubnets"
          + namespace = "aws:ec2:vpc"
          + resource  = ""
          + value     = "subnet-00515174,subnet-395eba5c"
        },
      + {
          + name      = "EnableSpot"
          + namespace = "aws:ec2:instances"
          + resource  = ""
          + value     = "false"
        },
      + {
          + name      = "EnvironmentType"
          + namespace = "aws:elasticbeanstalk:environment"
          + resource  = ""
          + value     = "LoadBalanced"
        },
      + {
          + name      = "HealthCheckPath"
          + namespace = "aws:elasticbeanstalk:environment:process:default"
          + resource  = ""
          + value     = "/varnish-ok"
        },
      + {
          + name      = "HealthStreamingEnabled"
          + namespace = "aws:elasticbeanstalk:cloudwatch:logs:health"
          + resource  = ""
          + value     = "false"
        },
      + {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + resource  = ""
          + value     = "onedio-test-varnish-test-eb-ec2"
        },
      + {
          + name      = "IgnoreHealthCheck"
          + namespace = "aws:elasticbeanstalk:command"
          + resource  = ""
          + value     = "false"
        },
      + {
          + name      = "InstancePort"
          + namespace = "aws:elb:listener"
          + resource  = ""
          + value     = "80"
        },
      + {
          + name      = "InstancePort"
          + namespace = "aws:elb:listener:22"
          + resource  = ""
          + value     = "22"
        },
      + {
          + name      = "InstancePort"
          + namespace = "aws:elb:listener:443"
          + resource  = ""
          + value     = "80"
        },
      + {
          + name      = "InstanceRefreshEnabled"
          + namespace = "aws:elasticbeanstalk:managedactions:platformupdate"
          + resource  = ""
          + value     = "true"
        },
      + {
          + name      = "InstanceTypes"
          + namespace = "aws:ec2:instances"
          + resource  = ""
          + value     = "t3.micro"
        },
      + {
          + name      = "ListenerEnabled"
          + namespace = "aws:elb:listener"
          + resource  = ""
          + value     = "true"
        },
      + {
          + name      = "ListenerEnabled"
          + namespace = "aws:elb:listener:22"
          + resource  = ""
          + value     = "false"
        },
      + {
          + name      = "ListenerEnabled"
          + namespace = "aws:elb:listener:443"
          + resource  = ""
          + value     = "false"
        },
      + {
          + name      = "ListenerProtocol"
          + namespace = "aws:elb:listener"
          + resource  = ""
          + value     = "HTTP"
        },
      + {
          + name      = "ListenerProtocol"
          + namespace = "aws:elb:listener:22"
          + resource  = ""
          + value     = "TCP"
        },
      + {
          + name      = "ListenerProtocol"
          + namespace = "aws:elb:listener:443"
          + resource  = ""
          + value     = "HTTPS"
        },
      + {
          + name      = "LoadBalancerType"
          + namespace = "aws:elasticbeanstalk:environment"
          + resource  = ""
          + value     = "classic"
        },
      + {
          + name      = "LogPublicationControl"
          + namespace = "aws:elasticbeanstalk:hostmanager"
          + resource  = ""
          + value     = "false"
        },
      + {
          + name      = "LowerBreachScaleIncrement"
          + namespace = "aws:autoscaling:trigger"
          + resource  = ""
          + value     = "-1"
        },
      + {
          + name      = "LowerThreshold"
          + namespace = "aws:autoscaling:trigger"
          + resource  = ""
          + value     = "20"
        },
      + {
          + name      = "ManagedActionsEnabled"
          + namespace = "aws:elasticbeanstalk:managedactions"
          + resource  = ""
          + value     = "false"
        },
      + {
          + name      = "ManagedActionsEnabled"
          + namespace = "aws:elasticbeanstalk:managedactions"
          + resource  = ""
          + value     = "true"
        },
      + {
          + name      = "ManagedSecurityGroup"
          + namespace = "aws:elb:loadbalancer"
          + resource  = ""
          + value     = ""
        },
      + {
          + name      = "MaxBatchSize"
          + namespace = "aws:autoscaling:updatepolicy:rollingupdate"
          + resource  = ""
          + value     = "1"
        },
      + {
          + name      = "MaxSize"
          + namespace = "aws:autoscaling:asg"
          + resource  = ""
          + value     = "2"
        },
      + {
          + name      = "MeasureName"
          + namespace = "aws:autoscaling:trigger"
          + resource  = ""
          + value     = "CPUUtilization"
        },
      + {
          + name      = "MinInstancesInService"
          + namespace = "aws:autoscaling:updatepolicy:rollingupdate"
          + resource  = ""
          + value     = "0"
        },
      + {
          + name      = "MinSize"
          + namespace = "aws:autoscaling:asg"
          + resource  = ""
          + value     = "1"
        },
      + {
          + name      = "Port"
          + namespace = "aws:elasticbeanstalk:environment:process:default"
          + resource  = ""
          + value     = "80"
        },
      + {
          + name      = "PreferredStartTime"
          + namespace = "aws:elasticbeanstalk:managedactions"
          + resource  = ""
          + value     = "Sun:10:00"
        },
      + {
          + name      = "Protocol"
          + namespace = "aws:elasticbeanstalk:environment:process:default"
          + resource  = ""
          + value     = "HTTP"
        },
      + {
          + name      = "RetentionInDays"
          + namespace = "aws:elasticbeanstalk:cloudwatch:logs"
          + resource  = ""
          + value     = "7"
        },
      + {
          + name      = "RetentionInDays"
          + namespace = "aws:elasticbeanstalk:cloudwatch:logs:health"
          + resource  = ""
          + value     = "7"
        },
      + {
          + name      = "RollingUpdateEnabled"
          + namespace = "aws:autoscaling:updatepolicy:rollingupdate"
          + resource  = ""
          + value     = "true"
        },
      + {
          + name      = "RollingUpdateType"
          + namespace = "aws:autoscaling:updatepolicy:rollingupdate"
          + resource  = ""
          + value     = "Health"
        },
      + {
          + name      = "RootVolumeSize"
          + namespace = "aws:autoscaling:launchconfiguration"
          + resource  = ""
          + value     = "20"
        },
      + {
          + name      = "RootVolumeType"
          + namespace = "aws:autoscaling:launchconfiguration"
          + resource  = ""
          + value     = "gp2"
        },
      + {
          + name      = "SSLCertificateId"
          + namespace = "aws:elb:listener:443"
          + resource  = ""
          + value     = ""
        },
      + {
          + name      = "SecurityGroups"
          + namespace = "aws:autoscaling:launchconfiguration"
          + resource  = ""
          + value     = (known after apply)
        },
      + {
          + name      = "SecurityGroups"
          + namespace = "aws:elb:loadbalancer"
          + resource  = ""
          + value     = "sg-0f8ba186278d9f047"
        },
      + {
          + name      = "ServiceRole"
          + namespace = "aws:elasticbeanstalk:environment"
          + resource  = ""
          + value     = "onedio-test-varnish-test-eb-service"
        },
      + {
          + name      = "SpotFleetOnDemandAboveBasePercentage"
          + namespace = "aws:ec2:instances"
          + resource  = ""
          + value     = "70"
        },
      + {
          + name      = "SpotFleetOnDemandBase"
          + namespace = "aws:ec2:instances"
          + resource  = ""
          + value     = "0"
        },
      + {
          + name      = "SpotMaxPrice"
          + namespace = "aws:ec2:instances"
          + resource  = ""
          + value     = ""
        },
      + {
          + name      = "Statistic"
          + namespace = "aws:autoscaling:trigger"
          + resource  = ""
          + value     = "Average"
        },
      + {
          + name      = "StickinessEnabled"
          + namespace = "aws:elasticbeanstalk:environment:process:default"
          + resource  = ""
          + value     = "false"
        },
      + {
          + name      = "StreamLogs"
          + namespace = "aws:elasticbeanstalk:cloudwatch:logs"
          + resource  = ""
          + value     = "false"
        },
      + {
          + name      = "Subnets"
          + namespace = "aws:ec2:vpc"
          + resource  = ""
          + value     = "subnet-00515174,subnet-395eba5c"
        },
      + {
          + name      = "SystemType"
          + namespace = "aws:elasticbeanstalk:healthreporting:system"
          + resource  = ""
          + value     = "enhanced"
        },
      + {
          + name      = "Timeout"
          + namespace = "aws:elasticbeanstalk:command"
          + resource  = ""
          + value     = "600"
        },
      + {
          + name      = "Unit"
          + namespace = "aws:autoscaling:trigger"
          + resource  = ""
          + value     = "Percent"
        },
      + {
          + name      = "UpdateLevel"
          + namespace = "aws:elasticbeanstalk:managedactions:platformupdate"
          + resource  = ""
          + value     = "minor"
        },
      + {
          + name      = "UpperBreachScaleIncrement"
          + namespace = "aws:autoscaling:trigger"
          + resource  = ""
          + value     = "1"
        },
      + {
          + name      = "UpperThreshold"
          + namespace = "aws:autoscaling:trigger"
          + resource  = ""
          + value     = "80"
        },
      + {
          + name      = "VPCId"
          + namespace = "aws:ec2:vpc"
          + resource  = ""
          + value     = "vpc-20938e42"
        },
    ]
  + elastic_beanstalk_environment_tier                           = "WebServer"
  + elastic_beanstalk_environment_triggers                       = (known after apply)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "onedio201604" but a
│ value was found in file "/github/workspace/elasticbeanstalk/ebs.tfvars". If
│ you meant to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
time=2021-04-27T22:48:49Z level=error msg=Hit multiple errors:
Hit multiple errors:
exit status 2
```

</details>

*Workflow: `Terragrunt Deploy Elasticbeanstalk`, Action: `the-commons-projectterragrunt-github-actions`, Working Directory: `./elasticbeanstalk`, Workspace: `default`*
